{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-COLOR",
    "1": "B-CPU",
    "2": "B-GPU",
    "3": "B-RAM",
    "4": "B-SCREEN",
    "5": "B-STORAGE",
    "6": "I-COLOR",
    "7": "I-CPU",
    "8": "I-GPU",
    "9": "I-RAM",
    "10": "I-SCREEN",
    "11": "I-STORAGE",
    "12": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-COLOR": 0,
    "B-CPU": 1,
    "B-GPU": 2,
    "B-RAM": 3,
    "B-SCREEN": 4,
    "B-STORAGE": 5,
    "I-COLOR": 6,
    "I-CPU": 7,
    "I-GPU": 8,
    "I-RAM": 9,
    "I-SCREEN": 10,
    "I-STORAGE": 11,
    "O": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
